app/controllers/flavours_controller.rb

  def index
    @flavours = Flavour.all
---
SELECT * FROM "flavours"

  def show
    @flavour = Flavour.find(params[:id])
---
SELECT * FROM "flavours" WHERE ("flavours"."id" = 1)

  def edit
    @flavour = Flavour.find(params[:id])
---
SELECT * FROM "flavours" WHERE ("flavours"."id" = 3)

  def create
    @flavour = Flavour.new(params[:flavour])

    respond_to do |format|
      if @flavour.save
---
INSERT INTO "flavours" ("name", "photo_file_name", "photo_file_size", "updated_at", "photo_updated_at", "photo_content_type", "created_at") VALUES('Original', 'britain.jpg', 40425, '2010-01-17 20:34:24', '2010-01-17 20:34:23', 'image/jpeg', '2010-01-17 20:34:24')

  def update
    @flavour = Flavour.find(params[:id])

    respond_to do |format|
      if @flavour.update_attributes(params[:flavour])
---
SELECT * FROM "flavours" WHERE ("flavours"."id" = 3)
UPDATE "flavours" SET "name" = 'Australasian', "updated_at" = '2010-01-17 20:39:43' WHERE "id" = 3