app/controllers/newsitems_controller.rb

SELECT * FROM "newsitems"
---
  def index
    @newsitems = Newsitem.all

SELECT * FROM "newsitems" WHERE ("newsitems"."id" = 3)
---
  def show
    @newsitem = Newsitem.find(params[:id])

SELECT * FROM "newsitems" WHERE ("newsitems"."id" = 1)
---
  def edit
    @newsitem = Newsitem.find(params[:id])

SELECT * FROM "newsitems" WHERE ("newsitems"."id" = 1)
UPDATE "newsitems" SET "updated_at" = '2010-05-17 12:05:56', "photo_file_name" = 'moray.png', "photo_file_size" = 111918, "photo_updated_at" = '2010-05-17 12:05:53', "Vietnamese_content" = '', "photo_content_type" = 'image/png' WHERE "id" = 1
---
  def update
    @newsitem = Newsitem.find(params[:id])

    respond_to do |format|
      if @newsitem.update_attributes(params[:newsitem])