app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM "pages"

  def show
    if params[:permalink]
      @page = Page.find_by_permalink(params[:permalink])
      raise ActiveRecord::RecordNotFound, "Page not found" if @page.nil?
    else
      @page = Page.find(params[:id])
    end

    @newsitems = Newsitem.all(:limit => 3, :order => "created_at DESC")
---
SELECT * FROM "pages" WHERE ("pages"."permalink" = 'home') LIMIT 1
SELECT * FROM "pages" WHERE ("pages"."id" = 2)
SELECT * FROM "newsitems" ORDER BY created_at DESC LIMIT 3

  def edit
    if params[:permalink]
      @page = Page.find_by_permalink(params[:permalink])
      raise ActiveRecord::RecordNotFound, "Page not found" if @page.nil?
    else
      @page = Page.find(params[:id])
    end
    @newsitems = Newsitem.all(:limit => 3, :order => "created_at DESC")
---
SELECT * FROM "pages" WHERE ("pages"."permalink" = 'home') LIMIT 1
SELECT * FROM "pages" WHERE ("pages"."id" = 9)
SELECT * FROM "newsitems" ORDER BY created_at DESC LIMIT 3

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 2)
UPDATE "pages" SET "updated_at" = '2010-05-24 07:20:57', "Vietnamese_content" = 'fksapig rw agpija g sgjn asgkjas gjs, aspijs sadv wajr piuw lxznkasdlvn fgojvlasnvm wjgpwjg lvcm lsakgpajgf slvz vamsnkwejpefu skxkvjweifjwgu wvkm sdhljg jk sdkj savipw sdlkj pke spj spos psgd jsgo sgokjcx vjsi rpij wg' WHERE "id" = 2