app/controllers/tutors_controller.rb

SELECT * FROM "tutors" WHERE ("tutors"."id" = 2)
---
  def show
    @tutor = Tutor.find(params[:id])

SELECT * FROM "tutors" WHERE ("tutors"."id" = 22)
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def new
    if session[:user_id] && User.find(session[:user_id]).tutor

SELECT * FROM "tutors" WHERE ("tutors"."id" = 1)
---
  def edit
    if session[:user_id]
      @tutor = Tutor.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "tutors" ("textbook_experience", "updated_at", "photo_file_name", "photo_file_size", "course_experience", "qualifications", "photo_updated_at", "national_knowledge", "sex", "flavour", "given_name", "family_name", "photo_content_type", "phone", "given_name_first", "age", "address", "experience", "created_at") VALUES('', '2009-12-01 05:10:07', NULL, NULL, '', '', NULL, '', 'm', '', 'connectteach', 'admin', NULL, NULL, 't', NULL, '', '', '2009-12-01 05:10:07')
UPDATE "users" SET "tutor_id" = NULL WHERE "id" = 1
---
  def create
    @tutor = Tutor.new(params[:tutor])
    @user = User.find(session[:user_id])
    # puts "***************************************************************************"
    # puts @user.tutor_id
    @user.tutor_id = @tutor.id
    # puts @user.tutor_id
    # puts "***************************************************************************"
    respond_to do |format|
      if @tutor.save && @user.save

SELECT * FROM "tutors" WHERE ("tutors"."id" = 22)
UPDATE "tutors" SET "experience" = 'sadg wgfioj awgpawg nkxcv;lkjwag jads awrpisv kWPIUWG PISDJV PWGNSDV adsfgojsag wgpjvc sgjwfi sij pitwe qerpi tqpuer qrtopiqpruper qpijqrpij qrpqra jlewt4 qj pqreiu epq rtqpri qrp quqprw qpwrq qpr qrp q', "national_knowledge" = 'sdj sdpj wepoiew sgpjkwe ', "course_experience" = 'sadg wgfioj awgpawg nkxcv;lkjwag jads awrpisv kWPIUWG PISDJV PWGNSDV adsfgojsag wgpjvc sgjwfi sij pitwe qerpi tqpuer qrtopiqpruper qpijqrpij qrpqra jlewt4 qj pqreiu epq rtqpri qrp quqprw qpwrq qpr qrp q', "updated_at" = '2010-01-17 18:48:03', "qualifications" = 'sadg wgfioj awgpawg nkxcv;lkjwag jads awrpisv kWPIUWG PISDJV PWGNSDV adsfgojsag wgpjvc sgjwfi sij pitwe qerpi tqpuer qrtopiqpruper qpijqrpij qrpqra jlewt4 qj pqreiu epq rtqpri qrp quqprw qpwrq qpr qrp q', "textbook_experience" = 'sdfoj sfpj wef se ' WHERE "id" = 22
---
  def update
    @tutor = Tutor.find(params[:id])

    respond_to do |format|
      if @tutor.update_attributes(params[:tutor])

SELECT * FROM "tutors" WHERE ("tutors"."id" = 6)
DELETE FROM "tutors" WHERE "id" = 6
---
  def destroy
    @tutor = Tutor.find(params[:id])
    @tutor.destroy