app/controllers/tutors_controller.rb

  def index
    @tutors = Tutor.find(:all, :order => :familyname)
---
SELECT * FROM "tutors" WHERE ("tutors"."id" = 22)