app/controllers/tutors_controller.rb

SELECT * FROM "tutors" ORDER BY family_name LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "tutors"
---
  def index

    # # @tutors = Tutor.all
    @tutors = Tutor.paginate :page => params[:page], :order => 'family_name'

SELECT * FROM "flavours"
---
  def new
    @flavours = Flavour.all

SELECT * FROM "flavours"
---
  def edit
    @flavours = Flavour.all